Revit 2026 API

# View3DSetRenderingSettings Method

---

Changes the rendering settings for this 3d view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetRenderingSettings(
	RenderingSettings settings
)
```
```vb
Public Sub SetRenderingSettings (
	settings As RenderingSettings
)
```
```cpp
public:
void SetRenderingSettings(
	RenderingSettings^ settings
)
```
```fsharp
member SetRenderingSettings :
        settings : RenderingSettings -> unit
```

#### Parameters

settings RenderingSettings
     The new rendering settings to be applied to this view.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace